Narin-Laboratory/libudawa-esp32/src/Udawa.h
#ifndef UDAWA_H
#define UDAWA_H
#include "params.h"
#include "UdawaLogger.h"
#include "UdawaWiFiHelper.h"
#include <functional> 
#include <vector>
#include "UdawaConfig.h"
#include "secret.h"
#include <ESP32Time.h>
#ifdef THINGSBOARD_ENABLE_STREAM_UTILS
#include <StreamUtils.h>
#endif
#include <ESPmDNS.h>
#ifdef USE_WIFI_OTA
#include <ArduinoOTA.h>
#endif
#ifdef USE_IOT
#include <Arduino_MQTT_Client.h>
#include <ThingsBoard.h>
#include <Attribute_Request.h>
#include <Shared_Attribute_Callback.h>
#include <Shared_Attribute_Update.h>
#include <OTA_Update_Callback.h>
#ifdef USE_IOT_OTA
#include <Espressif_Updater.h>
#include <OTA_Firmware_Update.h>
#endif
#endif
#ifdef USE_IOT_SECURE
#include <WiFiClientSecure.h>
#else
#include <WiFiClient.h>
#endif
#ifdef USE_WIFI_LOGGER
#include <UdawaWiFiLogger.h>
#endif
#include <NTPClient.h>
#include <WiFiUdp.h>
#ifdef USE_I2C
#include <Wire.h>
#endif
#ifdef USE_HW_RTC
#include <ErriezDS3231.h>
#endif
#ifdef USE_LOCAL_WEB_INTERFACE
#include <../lib/Crypto/src/Crypto.h>
#include <../lib/Crypto/src/SHA256.h>
#include <mbedtls/sha256.h>
#include <base64.h>
#include <map>
#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include "mbedtls/md.h"
#include "mbedtls/base64.h"
#include <mbedtls/ctr_drbg.h>
#include <mbedtls/entropy.h>
#endif
#include <HTTPClient.h>
#include <Update.h>

#define countof(a) (sizeof(a) / sizeof(a[0]))

struct CrashState{
    unsigned long rtcp = 0;
    int crashCnt = 0;
    bool fSafeMode = false;
    unsigned long crashStateCheckTimer = millis();
    bool crashStateCheckedFlag = false;
    unsigned long plannedRebootTimer = millis();
    unsigned int plannedRebootCountDown = 0;
    bool fPlannedReboot = false;
    bool fRTCHwDetected = false;
    unsigned long lastRecordedDatetime = 0;
    unsigned long lastRecordedDatetimeSavedTimer = 0;
    bool fFSDownloading = false;
    bool fStartServices = false;
    bool fStopServices = false;
    bool fDoInit = false;
};

struct AlarmMessage
{
    uint16_t code;
    uint8_t color; 
    int32_t blinkCount; 
    uint16_t blinkDelay;
};

#ifdef USE_IOT
struct IoTState{
    TaskHandle_t xHandleIoT = NULL;
    BaseType_t xReturnedIoT;
    SemaphoreHandle_t xSemaphoreThingsboard = NULL;
    bool fSharedAttributesSubscribed = false;
    bool fRebootRPCSubscribed = false;
    bool fConfigSaveRPCSubscribed = false;
    bool fIoTCurrentFWSent = false;
    bool fIoTUpdateRequestSent = false;
    bool fIoTUpdateStarted = false;
};
class UdawaThingsboardLogger{
    public:
        static void log(const char *error){
            UdawaLogger *_logger = UdawaLogger::getInstance(LogLevel::VERBOSE);
            _logger->debug(PSTR(__func__), PSTR("%s\n"), error);
        }
        template<typename ...Args>
        static int printfln(char const * const format, Args const &... args){
            UdawaLogger *_logger = UdawaLogger::getInstance(LogLevel::VERBOSE);
            size_t len = strlen(format);
            char newFormat[len + 2];  // +2 for '\n' and null terminator
            strcpy(newFormat, format);
            strcat(newFormat, "\n");

            _logger->debug(PSTR(__func__), newFormat, args...);
            return 1U;
        }
        static int println(char const * const message){
            UdawaLogger *_logger = UdawaLogger::getInstance(LogLevel::VERBOSE);
            _logger->debug(PSTR(__func__), PSTR("%s\n"), message);
            return 1U;
        }
};
#ifdef USE_IOT_OTA
constexpr std::array<const char*, 1U> REQUESTED_FW_CHECK_SHARED_ATTRIBUTES = {
    PSTR("fw_version")
};

template <size_t N>
Attribute_Request_Callback createFirmwareCheckCallback(
    std::function<void(const JsonObjectConst&)> callback,
    const std::array<const char*, N>& attributes) {
    return Attribute_Request_Callback(callback, attributes.begin(), attributes.end());
}
#endif
#endif

class Udawa {
    public:
        static Udawa* getInstance();
        void run();
        void begin();
        void FSDownloader();
        #ifdef USE_LOCAL_WEB_INTERFACE
        typedef std::function<void(AsyncWebSocket * server, AsyncWebSocketClient * client, 
                          AwsEventType type, void * arg, uint8_t *data, size_t len)> 
                          WsOnEventCallback;
        #endif
        #ifdef USE_IOT
        typedef std::function<void()> ThingsboardOnConnectedCallback;
        typedef std::function<void()> ThingsboardOnDisconnectedCallback;
        typedef std::function<void(const JsonObjectConst &data)> ThingsboardOnSharedAttributesReceivedCallback;
        bool iotSendAttributes(StaticJsonDocument<JSON_DOC_SIZE> &doc);
        bool iotSendAttributes(const char *buffer);
        bool iotSendTelemetry(StaticJsonDocument<JSON_DOC_SIZE> &doc);
        bool iotSendTelemetry(const char *buffer);
        #endif
        UdawaLogger *logger = UdawaLogger::getInstance(LogLevel::VERBOSE);
        UdawaSerialLogger *serialLogger = UdawaSerialLogger::getInstance(SERIAL_BAUD_RATE);
        #ifdef USE_WIFI_LOGGER
        UdawaWiFiLogger *wiFiLogger = UdawaWiFiLogger::getInstance("255.255.255.255", 29514, 256);
        #endif
        UdawaWiFiHelper wiFiHelper;
        UdawaConfig config;
        CrashState crashState;
        void setAlarm(uint16_t code, uint8_t color, int32_t blinkCount, uint16_t blinkDelay);

        #ifdef USE_LOCAL_WEB_INTERFACE
            String hmacSha256(String htP, String salt);
            AsyncWebServer http;
            AsyncWebSocket ws;
            void addOnWsEvent(WsOnEventCallback callback);
            void wsBroadcast(const char *buffer);
            void wsBroadcast(StaticJsonDocument<JSON_DOC_SIZE> &doc);
            SemaphoreHandle_t xSemaphoreWSBroadcast;
        #endif
        #ifdef USE_IOT
            void addOnThingsboardConnected(ThingsboardOnConnectedCallback callback);
            void addOnThingsboardDisconnected(ThingsboardOnDisconnectedCallback callback);
            void addOnThingsboardSharedAttributesReceived(ThingsboardOnSharedAttributesReceivedCallback callback);
            #ifdef USE_IOT_SECURE
                WiFiClientSecure _tcpClient;
                Arduino_MQTT_Client _mqttClient;
                
            #else
                WiFiClient _tcpClient;
                Arduino_MQTT_Client _mqttClient;
                
            #endif
            IoTState iotState;
        #endif
        void reboot(int countDown);
        ESP32Time RTC;
        void rtcUpdate(long ts);
        void syncClientAttr(uint8_t direction);
        typedef std::function<void(uint8_t direction)> SyncClientAttributesCallback;
        void addOnSyncClientAttributesCallback(SyncClientAttributesCallback callback);
        std::vector<SyncClientAttributesCallback> _onSyncClientAttributesCallback;

        typedef std::function<void()> FSDownloadedCallback;
        void addOnFSDownloadedCallback(FSDownloadedCallback callback);
        std::vector<FSDownloadedCallback> _onFSDownloadedCallback;

        void I2CScanner(StaticJsonDocument<JSON_DOC_SIZE> &doc);
        void I2CScanner();

    private:
        static Udawa* instance;
        Udawa();
        void _onWiFiConnected();
        void _onWiFiDisconnected();
        void _onWiFiGotIP();
        void _onWiFiAPNewClientIP();
        void _onWiFiAPStart();
        void _doInit();
        void _startServices();
        void _stopServices();
        void _setFInit(bool fInit);
        void _setLEDBuzzer(uint8_t color, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay);
        static void _alarmTaskRoutine(void *arg);
        TaskHandle_t _xHandleAlarm = NULL;
        BaseType_t _xReturnedAlarm;
        QueueHandle_t _xQueueAlarm;
        #ifdef USE_WIFI_OTA
            void _onWiFiOTAStart();
            void _onWiFiOTAEnd();
            void _onWiFiOTAProgress(unsigned int progress, unsigned int total);
            void _onWiFiOTAError(ota_error_t error);
        #endif
        #ifdef USE_LOCAL_WEB_INTERFACE
            void _onWsEvent(AsyncWebSocket * server, AsyncWebSocketClient * client, AwsEventType type, void * arg, uint8_t *data, size_t len);
            std::vector<WsOnEventCallback> _onWSEventCallbacks;
            std::map<uint32_t, bool> _wsClientAuthenticationStatus;
            std::map<IPAddress, unsigned long> _wsClientAuthAttemptTimestamps; 
            std::map<uint32_t, String> _wsClientSalts;
        #endif
        void _crashStateTruthKeeper(uint8_t direction);
        GenericConfig _crashStateConfig;
        #ifdef USE_IOT
            std::vector<ThingsboardOnConnectedCallback> _onThingsboardConnectedCallbacks;
            std::vector<ThingsboardOnDisconnectedCallback> _onThingsboardDisconnectedCallbacks;
            std::vector<ThingsboardOnSharedAttributesReceivedCallback> _onThingsboardSharedAttributesReceivedCallbacks;
            void _pvTaskCodeThingsboard(void *pvParameters);
            #ifdef USE_IOT_OTA
            
            #endif
        #endif
        #ifdef USE_HW_RTC
        ErriezDS3231 _hwRTC;
        #endif
};

#endif